package com.leetcode.L101_200.L0190;

public class ReverseBitsTest {
    public static void main(String[] args) {
        ReverseBits reverseBits = new ReverseBits();
        /*
          示例 1：
          输入：n = 00000010100101000001111010011100
          输出：964176192 (00111001011110000010100101000000)
          解释：输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
               因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
         */
        System.out.println(reverseBits.reverseBits(43261596));
        /*
          示例 2：
          输入：n = 11111111111111111111111111111101
          输出：3221225471 (10111111111111111111111111111111)
          解释：输入的二进制串 11111111111111111111111111111101 表示无符号整数 4294967293，
               因此返回 3221225471 其二进制表示形式为 10111111111111111111111111111111 。
         */

    }
}
