package com.leetcode.L701_800.L0717;

/**
 * 717. 1比特与2比特字符
 * 有两种特殊字符：
 * 第一种字符可以用一个比特 0 来表示
 * 第二种字符可以用两个比特(10 或 11)来表示、
 * 给定一个以 0 结尾的二进制数组 bits ，如果最后一个字符必须是一位字符，则返回 true 。
 *
 * 示例 1:
 * 输入: bits = [1, 0, 0]
 * 输出: true
 * 解释: 唯一的编码方式是一个两比特字符和一个一比特字符。
 * 所以最后一个字符是一比特字符。
 *
 * 示例 2:
 * 输入: bits = [1, 1, 1, 0]
 * 输出: false
 * 解释: 唯一的编码方式是两比特字符和两比特字符。
 * 所以最后一个字符不是一比特字符。
 *
 * 提示:
 * 1 <= bits.length <= 1000
 * bits[i] == 0 or 1
 */
public class BitCharacters {
    /**
     * 方法：模拟
     */
    public boolean isOneBitCharacter(int[] bits) {
        //索引
        int i=0;
        //长度
        int n = bits.length;
        //遍历
        while(i < n-1){
            //当前是1，会需要后面的一位所以i移动两2步
            //当前是0，只用移动1步
            i += bits[i] == 1 ? 2 : 1;
        }
        //最终落在最后一位上
        return i==n-1;
    }
}
