package com.leetcode.L1901_2000.L1905;

public class CountSubIslandsTest {
    public static void main(String[] args) {
        CountSubIslands countSubIslands = new CountSubIslands();
        /*
          示例 1：
          输入：grid1 = [[1,1,1,0,0],[0,1,1,1,1],[0,0,0,0,0],[1,0,0,0,0],[1,1,0,1,1]], grid2 = [[1,1,1,0,0],[0,0,1,1,1],[0,1,0,0,0],[1,0,1,1,0],[0,1,0,1,0]]
          输出：3
          解释：如上图所示，左边为 grid1 ，右边为 grid2 。
          grid2 中标红的 1 区域是子岛屿，总共有 3 个子岛屿。
         */
        System.out.println(countSubIslands.countSubIslands(
                new int[][]{{1, 1, 1, 0, 0}, {0, 1, 1, 1, 1}, {0, 0, 0, 0, 0}, {1, 0, 0, 0, 0}, {1, 1, 0, 1, 1}},
                new int[][]{{1, 1, 1, 0, 0}, {0, 0, 1, 1, 1}, {0, 1, 0, 0, 0}, {1, 0, 1, 1, 0}, {0, 1, 0, 1, 0}}));
        /*
          示例 2：
          输入：grid1 = [[1,0,1,0,1],[1,1,1,1,1],[0,0,0,0,0],[1,1,1,1,1],[1,0,1,0,1]], grid2 = [[0,0,0,0,0],[1,1,1,1,1],[0,1,0,1,0],[0,1,0,1,0],[1,0,0,0,1]]
          输出：2
          解释：如上图所示，左边为 grid1 ，右边为 grid2 。
          grid2 中标红的 1 区域是子岛屿，总共有 2 个子岛屿。
         */
        System.out.println(countSubIslands.countSubIslands(
                new int[][]{{1, 0, 1, 0, 1}, {1, 1, 1, 1, 1}, {0, 0, 0, 0, 0}, {1, 1, 1, 1, 1}, {1, 0, 1, 0, 1}},
                new int[][]{{0, 0, 0, 0, 0}, {1, 1, 1, 1, 1}, {0, 1, 0, 1, 0}, {0, 1, 0, 1, 0}, {1, 0, 0, 0, 1}}
        ));
    }
}
